# Module 06 Exercises

In [3]:
import pandas as pd
import numpy as np
import seaborn as sns

## Exercise 6.1

In [1]:
my_dict = {
    'features': [0.1, 0.2, 0.3, 0.4, 0.5],
    'labels': [1, 2, 3, 4 ,5]
}

In [4]:
df = pd.DataFrame(my_dict)

In [5]:
df

   features  labels
0       0.1       1
1       0.2       2
2       0.3       3
3       0.4       4
4       0.5       5

## Exercise 6.2

In [6]:
# rename the labels column in df to label

df = df.rename(columns = {'labels': 'label'})

In [7]:
df

   features  label
0       0.1      1
1       0.2      2
2       0.3      3
3       0.4      4
4       0.5      5

Exercise 6.3

In [8]:
# import the iris dataset from seaborn and sort by species, descending
iris = sns.load_dataset('iris')
iris = iris.sort_values(by = ['species'], ascending = False)

In [9]:
iris

     sepal_length  sepal_width  petal_length  petal_width    species
149           5.9          3.0           5.1          1.8  virginica
111           6.4          2.7           5.3          1.9  virginica
122           7.7          2.8           6.7          2.0  virginica
121           5.6          2.8           4.9          2.0  virginica
120           6.9          3.2           5.7          2.3  virginica
..            ...          ...           ...          ...        ...
31            5.4          3.4           1.5          0.4     setosa
30            4.8          3.1           1.6          0.2     setosa
29            4.7          3.2           1.6          0.2     setosa
28            5.2          3.4           1.4          0.2     setosa
0             5.1          3.5           1.4          0.2     setosa

[150 rows x 5 columns]

## Exercise 6.4

In [10]:
#use .value_counts() to find out how many records of each species the dataset has
#make sure the result is a df
iris.species.value_counts()

species
virginica     50
versicolor    50
setosa        50
Name: count, dtype: int64

In [11]:
iris.species.value_counts().to_frame('n')

             n
species
virginica   50
versicolor  50
setosa      50

## Exercise 6.5

In [14]:
#print the number of records in iris where petal_length <= 1.4 or petal_length >= 1.6
iris[(iris.petal_length <= 1.4) | (iris.petal_length >= 1.6)]

     sepal_length  sepal_width  petal_length  petal_width    species
149           5.9          3.0           5.1          1.8  virginica
111           6.4          2.7           5.3          1.9  virginica
122           7.7          2.8           6.7          2.0  virginica
121           5.6          2.8           4.9          2.0  virginica
120           6.9          3.2           5.7          2.3  virginica
..            ...          ...           ...          ...        ...
33            5.5          4.2           1.4          0.2     setosa
30            4.8          3.1           1.6          0.2     setosa
29            4.7          3.2           1.6          0.2     setosa
28            5.2          3.4           1.4          0.2     setosa
0             5.1          3.5           1.4          0.2     setosa

[137 rows x 5 columns]

## Exercise 6.6

In [15]:
#use .apply() to append a new column that displays the minimum of (petal_length, petal_width) for each observation
#display 
iris['petal_len_wid_avg'] = iris[['petal_length', 'petal_width']].apply(lambda x: (x.petal_length + x.petal_width) / 2, axis = 1)

In [16]:
iris['petal_len_wid_avg']

149    3.45
111    3.60
122    4.35
121    3.45
120    4.00
       ...
31     0.95
30     0.90
29     0.90
28     0.80
0      0.80
Name: petal_len_wid_avg, Length: 150, dtype: float64

## Exercise 6.7

In [19]:
iris['min_petal'] = iris.apply(lambda x: min(x.petal_length, x.petal_width), axis = 1)

In [20]:
iris ['min_petal']

149    1.8
111    1.9
122    2.0
121    2.0
120    2.3
      ...
31     0.4
30     0.2
29     0.2
28     0.2
0      0.2
Name: min_petal, Length: 150, dtype: float64

## Exercise 6.8

In [23]:
#use a pivto table to compute the following statistics on sepal_width and petal_width grouped by species:
# median and mean
#These can be computed together in a single call to pd.pivot_table()
pd.pivot_table(iris, values = ['sepal_width', 'petal_width'], columns = ['species'], aggfunc = {np.mean, np.median} ) #braces groups rows, brackets group columns

species             setosa  versicolor  virginica
petal_width mean     0.246       1.326      2.026
            median   0.200       1.300      2.000
sepal_width mean     3.428       2.770      2.974
            median   3.400       2.800      3.000

## Exercise 6.9

In [40]:
left = pd.DataFrame({'key': ["jamie", "bill"],
                     "left_val": [15, 22]})
left = left.set_index('key')

In [41]:
left

       left_val
key
jamie        15
bill         22

In [42]:
right = pd.DataFrame({'key': ["jamie", "bill", "asher"],
                     "right_val": [15, 22, 8]})

In [43]:
right = right.set_index('key')

In [44]:
right

       right_val
key
jamie         15
bill          22
asher          8

In [45]:
inner = pd.merge(left, right, on = "key", how = "inner")

In [46]:
inner

       left_val  right_val
key
jamie        15         15
bill         22         22

In [47]:
outer = left.join(right, how = 'outer')

In [48]:
outer

       left_val  right_val
key
asher       NaN          8
bill       22.0         22
jamie      15.0         15

## Exercise 6.9 (I miss counted somewhere)

In [49]:
#create a series with data [1,1,2,3,5,8]
#extract the data from the series in a NumPy array and reshape to 2x3
#print both the reshape data and its dimensions
data = pd.Series([1,1,2,3,5,8])
np_array = np.array(data).reshape(2,3)
np_array

array([[1, 1, 2],
       [3, 5, 8]])

In [50]:
np_array.shape

(2, 3)

## Exercise 6.10

In [51]:
cats = pd.DataFrame({
    'breed':['persian', 'persian', 'siamese', 'himalayan', 'burmese'],
    'color':['calico', 'white', 'seal point', 'cream', 'sable']
})

cats

       breed       color
0    persian      calico
1    persian       white
2    siamese  seal point
3  himalayan       cream
4    burmese       sable

In [52]:
dummy_cats = pd.get_dummies(cats, prefix = ['b', 'c'])
dummy_cats

,b_burmese,b_himalayan,b_persian,b_siamese,c_calico,c_cream,c_sable,c_seal point,c_white
0,False,False,True,False,True,False,False,False,False
1,False,False,True,False,False,False,False,False,True
2,False,False,False,True,False,False,False,True,False
3,False,True,False,False,False,True,False,False,False
4,True,False,False,False,False,False,True,False,False